#+BEGIN_QUOTE
How can this queer cosmic town, with its many-legged citizens, with
its monstrous and ancient lamps, how can this world give us at once
the fascination of a strange town and the comfort and honour of
being our own town?

---Gilbert Keith Chesterton, 1908
#+END_QUOTE

Node.Town is not a software project but a software quest.  Its goals
are uncertain, its methods are unproven, and its outcomes are unknown.

We can describe its current manifestation, and chronicle its winding
path, but we cannot predict its future, for it is a living thing.

Still, some dreams are worth writing down.  In lieu of a plan, here is
a compendium of ideas, a collection of notes, a catalog of desires.


* Microservices, Monorepos, Monoliths, Microliths

I like the idea of running our own =init= process.  I mean, =devenv=
is already an =init= process.  It's weird how these process managers
never support TTY multiplexing.  I mean, =tmux= is an =init= process?

The Telegram ingestion process should be in a separate pane in =tmux=.
It should be a separate process.  It should be a separate process
that is nimble, supple, and joyful.

Let's think about failure modes.  What happens if the Telegram
ingestion process crashes?  What happens if it gets stuck in an
infinite loop?  We need some notification mechanism.  We need some
way to restart it.

Wait.  Let's think about this.  Ingesting from Telegram should be
a simple =bash= script using =curl= and =jq=.

Let's write some =bash= functions and try running them using
=org-babel=.

#+BEGIN_SRC bash :results output
  set -ex
  skip() { echo >&2 "(skipping $1)"; cat; }

  redis-stream-push() { read -r x ; redis-cli xadd "$1" \* $*; }

  redis-stream-last() {
    redis-cli --raw xrevrange "$1" + - + count 1 | tail -n +3
  }

  token=$TELEGRAM_BOT_TOKEN
  stream=telegram:$token:updates

  telegram-last() { redis-stream-last "$stream" || echo 0; }

  telegram-next() {
      last=$(telegram-last)
      next=$((last + 1))
      echo "$next"
  }

  telegram-poll() {
    offset=$(telegram-next)
    curl -s "https://api.telegram.org/bot$token/getUpdates" \
      -d offset=$offset -d limit=100  -d timeout=60 \
    | skip jq -r '.result[]'
  }

  telegram-poll
#+END_SRC

#+RESULTS:
: {"ok":false,"error_code":404,"description":"Not Found"}

